blog/2016-08-26-linux用户与文件权限.org
#+TITLE: Linux用户与文件权限
#+DATE: 2016-05-21
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Linux管理
#+JEKYLL_TAGS: Linux 安全
#+JEKYLL_PUBLISHED: true


* 资源分派的过程
1. Authentication: 认证，表明你能进入系统
   - token: 口令
   - identity: 用户名和密码
2. Authorization: 授权，表明你有权限执行某些操作
   - 进程所能够访问的所有资源的权限取决于进程的发起者的身份
3. Accouting: 审计，验证你操作的合理性
* 用户(UID)
- 管理员root: 0
- 普通用户: 1-65535(2^16)
  - 系统用户: 1-499/999，系统用户用于对守护进程获取资源进行权限分配
  - 非系统用户: 500/1000+
* 组(GID)
- 管理员组root: 0
- 普通组
  - 系统组: 1-499/999
  - 非系统组: 500/1000+
- 用户的组的类别
  - 用户的基本组: 组名同用户名，且仅包含一个用户，即私有组
  - 用户的附加组(额外组)
* 配置文件
- /etc/passwd ::
  用户及其属性信息
  #+BEGIN_SRC yaml
  name:password:UID:GID:GECOS:directory:shell
  用户名:x:UID:GID:完整信息:主目录:默认shell
  #+END_SRC
- /etc/group ::
  组及其属性信息
  #+BEGIN_SRC yaml
  group_name:password:GID:user_list
  组名:x:GID:以当前组为附加组的用户列表(分隔符为逗号)
  #+END_SRC
- /etc/shadow ::
  用户密码及其相关属性
  #+BEGIN_SRC yaml
  用户名:加密密码:最近一次更改密码的日期:密码最小使用期限:密码最大使用期限:密码警告时间段:密码禁用期:账户过期日期:保留字段
    加密密码: 添加随机字符串后，进行sha512单向加密，初始的条件的微小改变，将会引起结果的巨大改变；若密码为 !! 则为空密码
  #+END_SRC
  - 用户名密码期限: 用户未修改密码时间到达 *密码警告时间段* 则会收到通知，到达 *密码最大使用期限* 会进入 *密码禁用期* ，若在这段时期没有登录的话，账号会被禁用(过期)
- /etc/gshadow ::
  组密码及其相关属性
- /etc/login.defs :: 
  定义相关的变量值，包括UID/GID范围等
* 用户与组相关命令
** id
查看用户信息，同时id能够用于判断用户是否存在
#+BEGIN_SRC yaml
id [OPTION]... [USER]
  -u: UID
  -g: GID
  -G: 显示所有组
  -n: 配合其他选项，显示名称而不是数字
#+END_SRC
** su
su(Switch User): 切换用户或以其他用户身份执行命令
#+BEGIN_SRC bash
su user     # 非登录式切换，即不会读取目标用户的配置文件
su - user   # 登录式切换，会读取目标用户的配置文件，完全切换
su [-] UserName -c 'COMMAND'  # 以其他用户的身份执行命令，不切换用户
#+END_SRC
- root切换至其他用户无须密码，而非root用户切换时需要密码
** sudo
授权之后，能够让某用户以其他用户的身份运行某些命令，同时会记录进日志中
#+BEGIN_SRC yaml
sudo [-u user] COMMAND 
  -u user: 默认为root
  -k: 重置输入用户密码
  -l: 显示当前用户能用sudo运行的命令
#+END_SRC
- 配置文件: sudoers，使用 =visudo= 命令进行编辑
  #+BEGIN_SRC yaml
  users  hosts=(runas)  [NOPASSWD:]commands,...  # 可以使用ALL来指定所有
    users: username、#uid、%group_name、%#gid
    hosts: ip、hostname、netaddr
    commands: command、directory、sudoedit

  Alias_Type NAME = item1, item2, ...  # 别名可以用于上边的配置行中，也可以用在其他别名中
    Alias_Type: User_Alias、Host_Alias、Runas_Alias、Cmnd_Alias
    NAME: 别名名称，必须使用全大写字母
    item: 以 ! 开头表示排除

  Cmnd_Alias PASSWD_CMND = /usr/bin/passwd [a-z]*, !/usr/bin/passwd root  # 防止用户更改root密码
  #+END_SRC
** newgrp
临时切换基本组
#+BEGIN_SRC bash
newgrp GROUP
# 如果用户本不属于GROUP，则需要组密码
#+END_SRC
** 用户相关
*** useradd
创建用户
#+BEGIN_SRC yaml
useradd [OPTION]... NAME
  -u UID: 范围是[UID_MIN, UID_MAX]
  -g GID: 指明用户所属基本组，可为组名
  -G GROUP1[,GROUP2,...[,GROUPN]]: 为用户指明附加组；组必须事先存在
  -r: 创建系统用户

  -m: 创建HOME目录，并复制/etc/skel内文件到这(默认)
  -d /PATH/TO/HOME_DIR: 以指定的路径为家目录

  -p PASSWORD: 为用户指定密码
  -s SHELL: 指明用户的默认shell程序，可用列表在/etc/shells文件中
  -c "COMMENT": 用户的注释信息(GECOS)
#+END_SRC
- 新建用户的默认值设定在 =/etc/default/useradd= 文件中
  #+BEGIN_SRC bash
  useradd -D  # 查询useradd默认值
  useradd -D [OPTION]...  # 修改useradd默认值
  #+END_SRC
