_posts/2016-08-26-linux用户与文件权限.html
---
title: "Linux用户与文件权限"
date: 2016-05-21
layout: post
categories: 
- Linux管理
tags: 
- Linux 
- 安全
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 资源分派的过程</a></li>
<li><a href="#orgheadline2">2. 用户(UID)</a></li>
<li><a href="#orgheadline3">3. 组(GID)</a></li>
<li><a href="#orgheadline4">4. 配置文件</a></li>
<li><a href="#orgheadline21">5. 用户与组相关命令</a>
<ul>
<li><a href="#orgheadline5">id</a></li>
<li><a href="#orgheadline6">su</a></li>
<li><a href="#orgheadline7">sudo</a></li>
<li><a href="#orgheadline8">newgrp</a></li>
<li><a href="#orgheadline14">用户相关</a>
<ul>
<li><a href="#orgheadline9">useradd</a></li>
<li><a href="#orgheadline10">usermod</a></li>
<li><a href="#orgheadline11">passwd</a></li>
<li><a href="#orgheadline12">chage</a></li>
<li><a href="#orgheadline13">userdel</a></li>
</ul>
</li>
<li><a href="#orgheadline19">组相关</a>
<ul>
<li><a href="#orgheadline15">groupadd</a></li>
<li><a href="#orgheadline16">groupmod</a></li>
<li><a href="#orgheadline17">gpasswd</a></li>
<li><a href="#orgheadline18">groupdel</a></li>
</ul>
</li>
<li><a href="#orgheadline20">其他</a></li>
</ul>
</li>
<li><a href="#orgheadline37">6. 文件权限管理</a>
<ul>
<li><a href="#orgheadline22">三类对象</a></li>
<li><a href="#orgheadline23">基本权限</a></li>
<li><a href="#orgheadline28">特殊权限</a>
<ul>
<li><a href="#orgheadline24">SUID(4)</a></li>
<li><a href="#orgheadline25">SGID(2)</a></li>
<li><a href="#orgheadline26">Sticky(1)</a></li>
<li><a href="#orgheadline27">权限位映射</a></li>
</ul>
</li>
<li><a href="#orgheadline29">修改文件权限: chmod</a></li>
<li><a href="#orgheadline30">修改文件的属主和属组</a></li>
<li><a href="#orgheadline31">文件遮罩码: umask</a></li>
<li><a href="#orgheadline32">隐藏权限</a></li>
<li><a href="#orgheadline36">ACL</a>
<ul>
<li><a href="#orgheadline33">ACL的类型</a></li>
<li><a href="#orgheadline34">设定ACL</a></li>
<li><a href="#orgheadline35">获取ACL</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 资源分派的过程</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Authentication: 认证，表明你能进入系统
<ul class="org-ul">
<li>token: 口令</li>
<li>identity: 用户名和密码</li>
</ul></li>
<li>Authorization: 授权，表明你有权限执行某些操作
<ul class="org-ul">
<li>进程所能够访问的所有资源的权限取决于进程的发起者的身份</li>
</ul></li>
<li>Accouting: 审计，验证你操作的合理性</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 用户(UID)</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>管理员root: 0</li>
<li>普通用户: 1-65535(2^16)
<ul class="org-ul">
<li>系统用户: 1-499/999，系统用户用于对守护进程获取资源进行权限分配</li>
<li>非系统用户: 500/1000+</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 组(GID)</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>管理员组root: 0</li>
<li>普通组
<ul class="org-ul">
<li>系统组: 1-499/999</li>
<li>非系统组: 500/1000+</li>
</ul></li>
<li>用户的组的类别
<ul class="org-ul">
<li>用户的基本组: 组名同用户名，且仅包含一个用户，即私有组</li>
<li>用户的附加组(额外组)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> 配置文件</h2>
<div class="outline-text-2" id="text-4">
<dl class="org-dl">
<dt>/etc/passwd</dt><dd><p>
  用户及其属性信息
</p>
<div class="org-src-container">

<pre class="src src-yaml">name:password:UID:GID:GECOS:directory:shell
&#29992;&#25143;&#21517;:x:UID:GID:&#23436;&#25972;&#20449;&#24687;:&#20027;&#30446;&#24405;:&#40664;&#35748;shell
</pre>
</div></dd>
<dt>/etc/group</dt><dd><p>
  组及其属性信息
</p>
<div class="org-src-container">

<pre class="src src-yaml">group_name:password:GID:user_list
&#32452;&#21517;:x:GID:&#20197;&#24403;&#21069;&#32452;&#20026;&#38468;&#21152;&#32452;&#30340;&#29992;&#25143;&#21015;&#34920;(&#20998;&#38548;&#31526;&#20026;&#36887;&#21495;)
</pre>
</div></dd>
<dt>/etc/shadow</dt><dd><p>
  用户密码及其相关属性
</p>
<div class="org-src-container">

<pre class="src src-yaml">&#29992;&#25143;&#21517;:&#21152;&#23494;&#23494;&#30721;:&#26368;&#36817;&#19968;&#27425;&#26356;&#25913;&#23494;&#30721;&#30340;&#26085;&#26399;:&#23494;&#30721;&#26368;&#23567;&#20351;&#29992;&#26399;&#38480;:&#23494;&#30721;&#26368;&#22823;&#20351;&#29992;&#26399;&#38480;:&#23494;&#30721;&#35686;&#21578;&#26102;&#38388;&#27573;:&#23494;&#30721;&#31105;&#29992;&#26399;:&#36134;&#25143;&#36807;&#26399;&#26085;&#26399;:&#20445;&#30041;&#23383;&#27573;
  <span style="color: #FD971F;">&#21152;&#23494;&#23494;&#30721;</span>: &#28155;&#21152;&#38543;&#26426;&#23383;&#31526;&#20018;&#21518;&#65292;&#36827;&#34892;sha512&#21333;&#21521;&#21152;&#23494;&#65292;&#21021;&#22987;&#30340;&#26465;&#20214;&#30340;&#24494;&#23567;&#25913;&#21464;&#65292;&#23558;&#20250;&#24341;&#36215;&#32467;&#26524;&#30340;&#24040;&#22823;&#25913;&#21464;&#65307;&#33509;&#23494;&#30721;&#20026; <span style="color: #66D9EF;">!!</span> &#21017;&#20026;&#31354;&#23494;&#30721;
</pre>
</div>
<ul class="org-ul">
<li>用户名密码期限: 用户未修改密码时间到达 <b>密码警告时间段</b> 则会收到通知，到达 <b>密码最大使用期限</b> 会进入 <b>密码禁用期</b> ，若在这段时期没有登录的话，账号会被禁用(过期)</li>
</ul></dd>
<dt>/etc/gshadow</dt><dd>组密码及其相关属性</dd>
<dt>/etc/login.defs</dt><dd>定义相关的变量值，包括UID/GID范围等</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">5</span> 用户与组相关命令</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">id</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
查看用户信息，同时id能够用于判断用户是否存在
</p>
<div class="org-src-container">

<pre class="src src-yaml">id [OPTION]... [USER]
  <span style="color: #FD971F;">-u</span>: UID
  <span style="color: #FD971F;">-g</span>: GID
  <span style="color: #FD971F;">-G</span>: &#26174;&#31034;&#25152;&#26377;&#32452;
  <span style="color: #FD971F;">-n</span>: &#37197;&#21512;&#20854;&#20182;&#36873;&#39033;&#65292;&#26174;&#31034;&#21517;&#31216;&#32780;&#19981;&#26159;&#25968;&#23383;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">su</h3>
<div class="outline-text-3" id="text-orgheadline6">
<p>
su(Switch User): 切换用户或以其他用户身份执行命令
</p>
<div class="org-src-container">

<pre class="src src-bash">su user     <span style="color: #75715E;"># </span><span style="color: #75715E;">&#38750;&#30331;&#24405;&#24335;&#20999;&#25442;&#65292;&#21363;&#19981;&#20250;&#35835;&#21462;&#30446;&#26631;&#29992;&#25143;&#30340;&#37197;&#32622;&#25991;&#20214;</span>
su - user   <span style="color: #75715E;"># </span><span style="color: #75715E;">&#30331;&#24405;&#24335;&#20999;&#25442;&#65292;&#20250;&#35835;&#21462;&#30446;&#26631;&#29992;&#25143;&#30340;&#37197;&#32622;&#25991;&#20214;&#65292;&#23436;&#20840;&#20999;&#25442;</span>
su <span style="color: #AE81FF;">[</span>-<span style="color: #AE81FF;">]</span> UserName -c <span style="color: #E6DB74;">'COMMAND'</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20197;&#20854;&#20182;&#29992;&#25143;&#30340;&#36523;&#20221;&#25191;&#34892;&#21629;&#20196;&#65292;&#19981;&#20999;&#25442;&#29992;&#25143;</span>
</pre>
</div>
<ul class="org-ul">
<li>root切换至其他用户无须密码，而非root用户切换时需要密码</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">sudo</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
授权之后，能够让某用户以其他用户的身份运行某些命令，同时会记录进日志中
</p>
<div class="org-src-container">

<pre class="src src-yaml">sudo [-u user] COMMAND 
  <span style="color: #FD971F;">-u user</span>: &#40664;&#35748;&#20026;root
  <span style="color: #FD971F;">-k</span>: &#37325;&#32622;&#36755;&#20837;&#29992;&#25143;&#23494;&#30721;
  <span style="color: #FD971F;">-l</span>: &#26174;&#31034;&#24403;&#21069;&#29992;&#25143;&#33021;&#29992;sudo&#36816;&#34892;&#30340;&#21629;&#20196;
</pre>
</div>
<ul class="org-ul">
<li><p>
配置文件: sudoers，使用 <code>visudo</code> 命令进行编辑
</p>
<div class="org-src-container">

<pre class="src src-yaml">users  hosts=(runas)  [NOPASSWD:]commands,...  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21487;&#20197;&#20351;&#29992;ALL&#26469;&#25351;&#23450;&#25152;&#26377;</span>
  <span style="color: #FD971F;">users</span>: username&#12289;#uid&#12289;%group_name&#12289;%#gid
  <span style="color: #FD971F;">hosts</span>: ip&#12289;hostname&#12289;netaddr
  <span style="color: #FD971F;">commands</span>: command&#12289;directory&#12289;sudoedit

Alias_Type NAME = item1, item2, ...  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21035;&#21517;&#21487;&#20197;&#29992;&#20110;&#19978;&#36793;&#30340;&#37197;&#32622;&#34892;&#20013;&#65292;&#20063;&#21487;&#20197;&#29992;&#22312;&#20854;&#20182;&#21035;&#21517;&#20013;</span>
  <span style="color: #FD971F;">Alias_Type</span>: User_Alias&#12289;Host_Alias&#12289;Runas_Alias&#12289;Cmnd_Alias
  <span style="color: #FD971F;">NAME</span>: &#21035;&#21517;&#21517;&#31216;&#65292;&#24517;&#39035;&#20351;&#29992;&#20840;&#22823;&#20889;&#23383;&#27597;
  <span style="color: #FD971F;">item</span>: &#20197; ! &#24320;&#22836;&#34920;&#31034;&#25490;&#38500;

Cmnd_Alias PASSWD_CMND = /usr/bin/passwd [a-z]*, <span style="color: #66D9EF;">!/usr/bin/passwd</span> root  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#38450;&#27490;&#29992;&#25143;&#26356;&#25913;root&#23494;&#30721;</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">newgrp</h3>
<div class="outline-text-3" id="text-orgheadline8">
<p>
临时切换基本组
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">newgrp</span> GROUP
<span style="color: #75715E;"># </span><span style="color: #75715E;">&#22914;&#26524;&#29992;&#25143;&#26412;&#19981;&#23646;&#20110;GROUP&#65292;&#21017;&#38656;&#35201;&#32452;&#23494;&#30721;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">用户相关</h3>
<div class="outline-text-3" id="text-orgheadline14">
</div><div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9">useradd</h4>
<div class="outline-text-4" id="text-orgheadline9">
<p>
创建用户
</p>
<div class="org-src-container">

<pre class="src src-yaml">useradd [OPTION]... NAME
  <span style="color: #FD971F;">-u UID</span>: &#33539;&#22260;&#26159;[UID_MIN, UID_MAX]
  <span style="color: #FD971F;">-g GID</span>: &#25351;&#26126;&#29992;&#25143;&#25152;&#23646;&#22522;&#26412;&#32452;&#65292;&#21487;&#20026;&#32452;&#21517;
  <span style="color: #FD971F;">-G GROUP1[,GROUP2,...[,GROUPN]]</span>: &#20026;&#29992;&#25143;&#25351;&#26126;&#38468;&#21152;&#32452;&#65307;&#32452;&#24517;&#39035;&#20107;&#20808;&#23384;&#22312;
  <span style="color: #FD971F;">-r</span>: &#21019;&#24314;&#31995;&#32479;&#29992;&#25143;

  <span style="color: #FD971F;">-m</span>: &#21019;&#24314;HOME&#30446;&#24405;&#65292;&#24182;&#22797;&#21046;/etc/skel&#20869;&#25991;&#20214;&#21040;&#36825;(&#40664;&#35748;)
  <span style="color: #FD971F;">-d /PATH/TO/HOME_DIR</span>: &#20197;&#25351;&#23450;&#30340;&#36335;&#24452;&#20026;&#23478;&#30446;&#24405;

  <span style="color: #FD971F;">-p PASSWORD</span>: &#20026;&#29992;&#25143;&#25351;&#23450;&#23494;&#30721;
  <span style="color: #FD971F;">-s SHELL</span>: &#25351;&#26126;&#29992;&#25143;&#30340;&#40664;&#35748;shell&#31243;&#24207;&#65292;&#21487;&#29992;&#21015;&#34920;&#22312;/etc/shells&#25991;&#20214;&#20013;
  -c <span style="color: #E6DB74;">"COMMENT"</span>: &#29992;&#25143;&#30340;&#27880;&#37322;&#20449;&#24687;(GECOS)
</pre>
</div>
<ul class="org-ul">
<li><p>
新建用户的默认值设定在 <code>/etc/default/useradd</code> 文件中
</p>
<div class="org-src-container">

<pre class="src src-bash">useradd -D  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#35810;useradd&#40664;&#35748;&#20540;</span>
useradd -D <span style="color: #AE81FF;">[</span>OPTION<span style="color: #AE81FF;">]</span>...  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20462;&#25913;useradd&#40664;&#35748;&#20540;</span>
</pre>
</div></li>
</ul>
</div>
</div>
