blog/2016-08-26-linux用户与文件权限.org
*** usermod
修改用户属性和过期日期
#+BEGIN_SRC yaml
usermod [OPTION] NAME
  -l login_name: 新的名字

  -u UID: 新UID
  -g GID: 新基本组
  -G GROUP1[,GROUP2,...[,GROUPN]]: 新附加组，原来的附加组将会被覆盖
    -a: 保留原有的附加组

  -s SHELL: 新的默认SHELL
  -c 'COMMENT': 新的注释信息
  -d HOME: 新的家目录，原有家目录中的文件不会同时移动至新的家目录
    -m: 移动原有家目录中的文件
  
  -L: lock指定用户(在加密密码前加 !)
  -U: unlock指定用户
  -e YYYY-MM-DD: 指明用户账号过期日期
#+END_SRC
*** passwd
添加或修改密码及密码期限相关内容
#+BEGIN_SRC yaml
passwd  # 修改自己的密码
passwd [OPTIONS] UserName  # 修改指定用户的密码，仅root用户可用
  -l: 锁定指定用户
  -u: 解锁指定用户

  -n mindays: 指定最短使用期限
  -x maxdays: 最大使用期限
  -w warndays: 提前多少天开始警告
  -i inactivedays: 密码禁用期
  
  --stdin: 从标准输入接收用户密码
#+END_SRC
*** chage
修改用户日期相关内容
#+BEGIN_SRC yaml
chage [OPTION]... NAME
  -d: LAST_DAY
  -E,--expiredate: EXPIRE_DATE
  -I,--inactive: INACTIVE
  -m,--mindays: MIN_DAYS
  -M,--maxdays: MAX_DAYS
  -W,--warndays: WARN_DAYS
#+END_SRC
*** userdel
删除用户
#+BEGIN_SRC yaml
userdel [OPTION]... NAME
  -r: 同时删除用户家目录
#+END_SRC
** 组相关
*** groupadd
创建组
#+BEGIN_SRC yaml
groupadd [OPTION]... group_name
  -g GID: 范围是[GID_MIN, GID_MAX]
  -r: 创建系统组
#+END_SRC
*** groupmod
修改组属性
#+BEGIN_SRC yaml
groupmod [OPTION]... group
  -n group_name: 新名字
  -g GID: 新的GID
#+END_SRC
*** gpasswd
修改组密码和添加删除组员
#+BEGIN_SRC yaml
gpasswd [OPTION] GROUP
  -a user: 将user添加至指定组中
  -d user: 删除用户user的以当前组为组名的附加组
  -A user1,user2,...: 设置群组管理员，群组管理员可以管理哪些帐号可以加入/移出该群组
#+END_SRC
*** groupdel
删除组
#+BEGIN_SRC yaml
groupdel GROUP
#+END_SRC
** 其他
- pwck :: 
  检查密码文件的完整性
- chfn ::
  设置用户详细信息
- finger ::
  查看用户详细信息
- chsh ::
  更改用户的默认shell
  #+BEGIN_SRC yaml
  chsh [OPTIONS] [username]  # 默认更改自己的shell
    -s SHELL: 指定shell
  #+END_SRC
* 文件权限管理
** 三类对象
- owner: 属主 u
- group: 属组 g
- other: 其他 o
** 基本权限
- 基本权限 ::
  - r(4): Readable  
  - w(2): Writable  
  - x(1): eXcutable
- 文件的基本权限 ::
  - r: 可使用文件查看类工具获取其内容
  - w: 可修改其内容
  - x: 可以把此文件提请内核启动为一个进程
- 目录的基本权限 ::
  - r: 可以使用ls查看此目录中文件列表
  - w: 可在此目录中创建文件，也可删除此目录中的文件
  - x: 无法执行该目录下的任何命令，包括创建和删除文件
** 特殊权限
*** SUID(4)
默认情况下，启动为进程之后，其进程的属主为发起者，进程的属组为发起者所属的组；而启动带SUID的程序文件时，其进程的属主为原程序文件的属主
#+BEGIN_SRC bash
chmod u+s FILE
chmod u-s FILE
#+END_SRC
*** SGID(2)
默认情况下，用户创建文件时，其属组为此用户所属的基本组；一旦某目录被设定了SGID，则对此目录有写权限的用户在此目录中创建的文件所属的组为此目录的属组
#+BEGIN_SRC bash
chmod g+s FILE
chmod g-s FILE
#+END_SRC
- 经常用于团队协作，因为创建的文件后其他人不会被当作other
- 如果对可执行文件设定SGID，则文件执行后的进程属组是文件的属组
*** Sticky(1)
对于一个多人可写的目录，如果设置了sticky，则每个用户仅能删除自己的文件；如果对文件设定，则该文件只能由属主执行删除和移动
#+BEGIN_SRC yaml
chmod o+t FILE
chmod o-t FILE
#+END_SRC
- =/tmp= 就有Sticky权限
*** 权限位映射
- SUID: user, 占据属主的执行权限位
  - s: 属主拥有x权限
  - S: 属主没有x权限
- SGID: group,  占据group的执行权限位
  - s: group拥有x权限
  - S: group没有x权限	
- Sticky: other, 占据ohter的执行权限位
  - t: other拥有x权限
  - T: other没有x权限
** 修改文件权限: chmod
#+BEGIN_SRC yaml
chmod [OPTION]... MODE FILE...
  -R: 递归修改权限
  MODE: 
    - 可使用数字权限，如4755(最左边一位是特殊权限，可以不写)
    - 可修改一类用户的权限，如 u=rwx,g+w,o-rwx,a-x

chmod [OPTION]... --reference=RFILE FILE...  # 参考RFILE文件的权限，将FILE的修改为同RFILE一样的权限
#+END_SRC
** 修改文件的属主和属组
- chown ::
  修改属主
  #+BEGIN_SRC yaml
  chown [OPTION]... [OWNER][:[GROUP]] FILE...
  chown [OPTION]... --reference=RFILE FILE...
    -R: 目录递归修改
  # chown也可只改属组，即不写OWNER
  #+END_SRC
- chgrp :: 
  修改属组
  #+BEGIN_SRC yaml
  chgrp [OPTION]... GROUP FILE...
  chgrp [OPTION]... --reference=RFILE FILE...
    -R: 目录递归修改
  #+END_SRC
