_posts/2016-08-26-linux用户与文件权限.html
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10">usermod</h4>
<div class="outline-text-4" id="text-orgheadline10">
<p>
修改用户属性和过期日期
</p>
<div class="org-src-container">

<pre class="src src-yaml">usermod [OPTION] NAME
  <span style="color: #FD971F;">-l login_name</span>: &#26032;&#30340;&#21517;&#23383;

  <span style="color: #FD971F;">-u UID</span>: &#26032;UID
  <span style="color: #FD971F;">-g GID</span>: &#26032;&#22522;&#26412;&#32452;
  <span style="color: #FD971F;">-G GROUP1[,GROUP2,...[,GROUPN]]</span>: &#26032;&#38468;&#21152;&#32452;&#65292;&#21407;&#26469;&#30340;&#38468;&#21152;&#32452;&#23558;&#20250;&#34987;&#35206;&#30422;
    <span style="color: #FD971F;">-a</span>: &#20445;&#30041;&#21407;&#26377;&#30340;&#38468;&#21152;&#32452;

  <span style="color: #FD971F;">-s SHELL</span>: &#26032;&#30340;&#40664;&#35748;SHELL
  -c <span style="color: #E6DB74;">'COMMENT'</span>: &#26032;&#30340;&#27880;&#37322;&#20449;&#24687;
  <span style="color: #FD971F;">-d HOME</span>: &#26032;&#30340;&#23478;&#30446;&#24405;&#65292;&#21407;&#26377;&#23478;&#30446;&#24405;&#20013;&#30340;&#25991;&#20214;&#19981;&#20250;&#21516;&#26102;&#31227;&#21160;&#33267;&#26032;&#30340;&#23478;&#30446;&#24405;
    <span style="color: #FD971F;">-m</span>: &#31227;&#21160;&#21407;&#26377;&#23478;&#30446;&#24405;&#20013;&#30340;&#25991;&#20214;

  <span style="color: #FD971F;">-L</span>: lock&#25351;&#23450;&#29992;&#25143;(&#22312;&#21152;&#23494;&#23494;&#30721;&#21069;&#21152; <span style="color: #66D9EF;">!)</span>
  <span style="color: #FD971F;">-U</span>: unlock&#25351;&#23450;&#29992;&#25143;
  <span style="color: #FD971F;">-e YYYY-MM-DD</span>: &#25351;&#26126;&#29992;&#25143;&#36134;&#21495;&#36807;&#26399;&#26085;&#26399;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11">passwd</h4>
<div class="outline-text-4" id="text-orgheadline11">
<p>
添加或修改密码及密码期限相关内容
</p>
<div class="org-src-container">

<pre class="src src-yaml">passwd  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20462;&#25913;&#33258;&#24049;&#30340;&#23494;&#30721;</span>
passwd [OPTIONS] UserName  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20462;&#25913;&#25351;&#23450;&#29992;&#25143;&#30340;&#23494;&#30721;&#65292;&#20165;root&#29992;&#25143;&#21487;&#29992;</span>
  <span style="color: #FD971F;">-l</span>: &#38145;&#23450;&#25351;&#23450;&#29992;&#25143;
  <span style="color: #FD971F;">-u</span>: &#35299;&#38145;&#25351;&#23450;&#29992;&#25143;

  <span style="color: #FD971F;">-n mindays</span>: &#25351;&#23450;&#26368;&#30701;&#20351;&#29992;&#26399;&#38480;
  <span style="color: #FD971F;">-x maxdays</span>: &#26368;&#22823;&#20351;&#29992;&#26399;&#38480;
  <span style="color: #FD971F;">-w warndays</span>: &#25552;&#21069;&#22810;&#23569;&#22825;&#24320;&#22987;&#35686;&#21578;
  <span style="color: #FD971F;">-i inactivedays</span>: &#23494;&#30721;&#31105;&#29992;&#26399;

  <span style="color: #FD971F;">--stdin</span>: &#20174;&#26631;&#20934;&#36755;&#20837;&#25509;&#25910;&#29992;&#25143;&#23494;&#30721;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12">chage</h4>
<div class="outline-text-4" id="text-orgheadline12">
<p>
修改用户日期相关内容
</p>
<div class="org-src-container">

<pre class="src src-yaml">chage [OPTION]... NAME
  <span style="color: #FD971F;">-d</span>: LAST_DAY
  <span style="color: #FD971F;">-E,--expiredate</span>: EXPIRE_DATE
  <span style="color: #FD971F;">-I,--inactive</span>: INACTIVE
  <span style="color: #FD971F;">-m,--mindays</span>: MIN_DAYS
  <span style="color: #FD971F;">-M,--maxdays</span>: MAX_DAYS
  <span style="color: #FD971F;">-W,--warndays</span>: WARN_DAYS
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13">userdel</h4>
<div class="outline-text-4" id="text-orgheadline13">
<p>
删除用户
</p>
<div class="org-src-container">

<pre class="src src-yaml">userdel [OPTION]... NAME
  <span style="color: #FD971F;">-r</span>: &#21516;&#26102;&#21024;&#38500;&#29992;&#25143;&#23478;&#30446;&#24405;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19">组相关</h3>
<div class="outline-text-3" id="text-orgheadline19">
</div><div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15">groupadd</h4>
<div class="outline-text-4" id="text-orgheadline15">
<p>
创建组
</p>
<div class="org-src-container">

<pre class="src src-yaml">groupadd [OPTION]... group_name
  <span style="color: #FD971F;">-g GID</span>: &#33539;&#22260;&#26159;[GID_MIN, GID_MAX]
  <span style="color: #FD971F;">-r</span>: &#21019;&#24314;&#31995;&#32479;&#32452;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16">groupmod</h4>
<div class="outline-text-4" id="text-orgheadline16">
<p>
修改组属性
</p>
<div class="org-src-container">

<pre class="src src-yaml">groupmod [OPTION]... group
  <span style="color: #FD971F;">-n group_name</span>: &#26032;&#21517;&#23383;
  <span style="color: #FD971F;">-g GID</span>: &#26032;&#30340;GID
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17">gpasswd</h4>
<div class="outline-text-4" id="text-orgheadline17">
<p>
修改组密码和添加删除组员
</p>
<div class="org-src-container">

<pre class="src src-yaml">gpasswd [OPTION] GROUP
  <span style="color: #FD971F;">-a user</span>: &#23558;user&#28155;&#21152;&#33267;&#25351;&#23450;&#32452;&#20013;
  <span style="color: #FD971F;">-d user</span>: &#21024;&#38500;&#29992;&#25143;user&#30340;&#20197;&#24403;&#21069;&#32452;&#20026;&#32452;&#21517;&#30340;&#38468;&#21152;&#32452;
  <span style="color: #FD971F;">-A user1,user2,...</span>: &#35774;&#32622;&#32676;&#32452;&#31649;&#29702;&#21592;&#65292;&#32676;&#32452;&#31649;&#29702;&#21592;&#21487;&#20197;&#31649;&#29702;&#21738;&#20123;&#24080;&#21495;&#21487;&#20197;&#21152;&#20837;/&#31227;&#20986;&#35813;&#32676;&#32452;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18">groupdel</h4>
<div class="outline-text-4" id="text-orgheadline18">
<p>
删除组
</p>
<div class="org-src-container">

<pre class="src src-yaml">groupdel GROUP
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20">其他</h3>
<div class="outline-text-3" id="text-orgheadline20">
<dl class="org-dl">
<dt>pwck</dt><dd>检查密码文件的完整性</dd>
<dt>chfn</dt><dd>设置用户详细信息</dd>
<dt>finger</dt><dd>查看用户详细信息</dd>
<dt>chsh</dt><dd><p>
  更改用户的默认shell
</p>
<div class="org-src-container">

<pre class="src src-yaml">chsh [OPTIONS] [username]  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#40664;&#35748;&#26356;&#25913;&#33258;&#24049;&#30340;shell</span>
  <span style="color: #FD971F;">-s SHELL</span>: &#25351;&#23450;shell
</pre>
</div></dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37"><span class="section-number-2">6</span> 文件权限管理</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22">三类对象</h3>
<div class="outline-text-3" id="text-orgheadline22">
<ul class="org-ul">
<li>owner: 属主 u</li>
<li>group: 属组 g</li>
<li>other: 其他 o</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23">基本权限</h3>
<div class="outline-text-3" id="text-orgheadline23">
<dl class="org-dl">
<dt>基本权限</dt><dd><ul class="org-ul">
<li>r(4): Readable</li>
<li>w(2): Writable</li>
<li>x(1): eXcutable</li>
</ul></dd>
<dt>文件的基本权限</dt><dd><ul class="org-ul">
<li>r: 可使用文件查看类工具获取其内容</li>
<li>w: 可修改其内容</li>
<li>x: 可以把此文件提请内核启动为一个进程</li>
</ul></dd>
<dt>目录的基本权限</dt><dd><ul class="org-ul">
<li>r: 可以使用ls查看此目录中文件列表</li>
<li>w: 可在此目录中创建文件，也可删除此目录中的文件</li>
<li>x: 无法执行该目录下的任何命令，包括创建和删除文件</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28">特殊权限</h3>
<div class="outline-text-3" id="text-orgheadline28">
</div><div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24">SUID(4)</h4>
<div class="outline-text-4" id="text-orgheadline24">
<p>
默认情况下，启动为进程之后，其进程的属主为发起者，进程的属组为发起者所属的组；而启动带SUID的程序文件时，其进程的属主为原程序文件的属主
</p>
<div class="org-src-container">

<pre class="src src-bash">chmod u+s FILE
chmod u-s FILE
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25">SGID(2)</h4>
<div class="outline-text-4" id="text-orgheadline25">
<p>
默认情况下，用户创建文件时，其属组为此用户所属的基本组；一旦某目录被设定了SGID，则对此目录有写权限的用户在此目录中创建的文件所属的组为此目录的属组
</p>
<div class="org-src-container">

<pre class="src src-bash">chmod g+s FILE
chmod g-s FILE
</pre>
</div>
<ul class="org-ul">
<li>经常用于团队协作，因为创建的文件后其他人不会被当作other</li>
<li>如果对可执行文件设定SGID，则文件执行后的进程属组是文件的属组</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26">Sticky(1)</h4>
<div class="outline-text-4" id="text-orgheadline26">
<p>
对于一个多人可写的目录，如果设置了sticky，则每个用户仅能删除自己的文件；如果对文件设定，则该文件只能由属主执行删除和移动
</p>
<div class="org-src-container">

<pre class="src src-yaml">chmod o+t FILE
chmod o-t FILE
</pre>
</div>
<ul class="org-ul">
<li><code>/tmp</code> 就有Sticky权限</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27">权限位映射</h4>
<div class="outline-text-4" id="text-orgheadline27">
<ul class="org-ul">
<li>SUID: user, 占据属主的执行权限位
<ul class="org-ul">
<li>s: 属主拥有x权限</li>
<li>S: 属主没有x权限</li>
</ul></li>
<li>SGID: group,  占据group的执行权限位
<ul class="org-ul">
<li>s: group拥有x权限</li>
<li>S: group没有x权限</li>
</ul></li>
<li>Sticky: other, 占据ohter的执行权限位
<ul class="org-ul">
<li>t: other拥有x权限</li>
<li>T: other没有x权限</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29">修改文件权限: chmod</h3>
<div class="outline-text-3" id="text-orgheadline29">
<div class="org-src-container">

<pre class="src src-yaml">chmod [OPTION]... MODE FILE...
  <span style="color: #FD971F;">-R</span>: &#36882;&#24402;&#20462;&#25913;&#26435;&#38480;
  <span style="color: #FD971F;">MODE</span>: 
    - &#21487;&#20351;&#29992;&#25968;&#23383;&#26435;&#38480;&#65292;&#22914;4755(&#26368;&#24038;&#36793;&#19968;&#20301;&#26159;&#29305;&#27530;&#26435;&#38480;&#65292;&#21487;&#20197;&#19981;&#20889;)
    - &#21487;&#20462;&#25913;&#19968;&#31867;&#29992;&#25143;&#30340;&#26435;&#38480;&#65292;&#22914; u=rwx,g+w,o-rwx,a-x

chmod [OPTION]... --reference=RFILE FILE...  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21442;&#32771;RFILE&#25991;&#20214;&#30340;&#26435;&#38480;&#65292;&#23558;FILE&#30340;&#20462;&#25913;&#20026;&#21516;RFILE&#19968;&#26679;&#30340;&#26435;&#38480;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30">修改文件的属主和属组</h3>
<div class="outline-text-3" id="text-orgheadline30">
<dl class="org-dl">
<dt>chown</dt><dd><p>
  修改属主
</p>
<div class="org-src-container">

<pre class="src src-yaml">chown [OPTION]... [OWNER][:[GROUP]] FILE...
chown [OPTION]... --reference=RFILE FILE...
  <span style="color: #FD971F;">-R</span>: &#30446;&#24405;&#36882;&#24402;&#20462;&#25913;
<span style="color: #75715E;"># </span><span style="color: #75715E;">chown&#20063;&#21487;&#21482;&#25913;&#23646;&#32452;&#65292;&#21363;&#19981;&#20889;OWNER</span>
</pre>
</div></dd>
<dt>chgrp</dt><dd><p>
  修改属组
</p>
<div class="org-src-container">

<pre class="src src-yaml">chgrp [OPTION]... GROUP FILE...
chgrp [OPTION]... --reference=RFILE FILE...
  <span style="color: #FD971F;">-R</span>: &#30446;&#24405;&#36882;&#24402;&#20462;&#25913;
</pre>
</div></dd>
</dl>
</div>
</div>
