blog/2016-08-26-linux用户与文件权限.org
** 文件遮罩码: umask
- 创建文件时，文件的权限是 666-umask
- 创建目录时，目录的权限是 777-umask
#+BEGIN_SRC bash
umask  # 查看umask
umask num  # 设置umask，仅对当前shell有效
#+END_SRC
** 隐藏权限
- 设置隐藏权限 ::
  #+BEGIN_SRC yaml
  chattr [+-=] [OPTIONS] 文件/目录 
    a: 只能增加数据, 不能删除和修改
    i: 不允许对文件/目录做任何修改
    S: 修改时同步写入磁盘

    A: 锁定atime
    d: 该文件或目录不会被dump备份
  #+END_SRC
- 查询隐藏权限 ::
  #+BEGIN_SRC yaml
  lsattr [OPTIONS] 文件/目录
    -a: 显示隐藏文件
    -d: 仅显示目录
    -R: 连同子目录也显示出来
  #+END_SRC
** ACL
*** ACL的类型
ACL(Access Control List)可以针对一个指定用户，一个文件或目录来进行权限设置
- 针对用户: =u:[USERNAME]:rw= (省略用户名则等同于设置基本权限)
- 针对组: =g:[GROUPNAME]:rw= (省略组名则等同于设置基本权限)
- 设置有效权限(允许的最大权限): =m:rwx=
- 设置目录的继承权限(目录下新建的文件和目录会继承该权限): =d:ACL参数=

*** 设定ACL
#+BEGIN_SRC yaml
setfacl [OPTIONS] 文件/目录
  -m ACL参数: 设定指定的ACL参数
  -x ACL参数: 删除指定的ACL参数(删除时无需指明权限)

  -R: 递归设定ACL

  -b: 删除所有的ACL设定
  -x: 删除default的ACL设定
#+END_SRC

*** 获取ACL
#+BEGIN_SRC bash
getfacl 文件/目录
#+END_SRC
