_posts/2016-08-26-linux用户与文件权限.html
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31">文件遮罩码: umask</h3>
<div class="outline-text-3" id="text-orgheadline31">
<ul class="org-ul">
<li>创建文件时，文件的权限是 666-umask</li>
<li>创建目录时，目录的权限是 777-umask</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">umask</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#30475;umask</span>
<span style="color: #F92672;">umask</span> num  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35774;&#32622;umask&#65292;&#20165;&#23545;&#24403;&#21069;shell&#26377;&#25928;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32">隐藏权限</h3>
<div class="outline-text-3" id="text-orgheadline32">
<dl class="org-dl">
<dt>设置隐藏权限</dt><dd><div class="org-src-container">

<pre class="src src-yaml">chattr [+-=] [OPTIONS] &#25991;&#20214;/&#30446;&#24405; 
  <span style="color: #FD971F;">a</span>: &#21482;&#33021;&#22686;&#21152;&#25968;&#25454;, &#19981;&#33021;&#21024;&#38500;&#21644;&#20462;&#25913;
  <span style="color: #FD971F;">i</span>: &#19981;&#20801;&#35768;&#23545;&#25991;&#20214;/&#30446;&#24405;&#20570;&#20219;&#20309;&#20462;&#25913;
  <span style="color: #FD971F;">S</span>: &#20462;&#25913;&#26102;&#21516;&#27493;&#20889;&#20837;&#30913;&#30424;

  <span style="color: #FD971F;">A</span>: &#38145;&#23450;atime
  <span style="color: #FD971F;">d</span>: &#35813;&#25991;&#20214;&#25110;&#30446;&#24405;&#19981;&#20250;&#34987;dump&#22791;&#20221;
</pre>
</div></dd>
<dt>查询隐藏权限</dt><dd><div class="org-src-container">

<pre class="src src-yaml">lsattr [OPTIONS] &#25991;&#20214;/&#30446;&#24405;
  <span style="color: #FD971F;">-a</span>: &#26174;&#31034;&#38544;&#34255;&#25991;&#20214;
  <span style="color: #FD971F;">-d</span>: &#20165;&#26174;&#31034;&#30446;&#24405;
  <span style="color: #FD971F;">-R</span>: &#36830;&#21516;&#23376;&#30446;&#24405;&#20063;&#26174;&#31034;&#20986;&#26469;
</pre>
</div></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36">ACL</h3>
<div class="outline-text-3" id="text-orgheadline36">
</div><div id="outline-container-orgheadline33" class="outline-4">
<h4 id="orgheadline33">ACL的类型</h4>
<div class="outline-text-4" id="text-orgheadline33">
<p>
ACL(Access Control List)可以针对一个指定用户，一个文件或目录来进行权限设置
</p>
<ul class="org-ul">
<li>针对用户: <code>u:[USERNAME]:rw</code> (省略用户名则等同于设置基本权限)</li>
<li>针对组: <code>g:[GROUPNAME]:rw</code> (省略组名则等同于设置基本权限)</li>
<li>设置有效权限(允许的最大权限): <code>m:rwx</code></li>
<li>设置目录的继承权限(目录下新建的文件和目录会继承该权限): <code>d:ACL参数</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34">设定ACL</h4>
<div class="outline-text-4" id="text-orgheadline34">
<div class="org-src-container">

<pre class="src src-yaml">setfacl [OPTIONS] &#25991;&#20214;/&#30446;&#24405;
  <span style="color: #FD971F;">-m ACL&#21442;&#25968;</span>: &#35774;&#23450;&#25351;&#23450;&#30340;ACL&#21442;&#25968;
  <span style="color: #FD971F;">-x ACL&#21442;&#25968;</span>: &#21024;&#38500;&#25351;&#23450;&#30340;ACL&#21442;&#25968;(&#21024;&#38500;&#26102;&#26080;&#38656;&#25351;&#26126;&#26435;&#38480;)

  <span style="color: #FD971F;">-R</span>: &#36882;&#24402;&#35774;&#23450;ACL

  <span style="color: #FD971F;">-b</span>: &#21024;&#38500;&#25152;&#26377;&#30340;ACL&#35774;&#23450;
  <span style="color: #FD971F;">-x</span>: &#21024;&#38500;default&#30340;ACL&#35774;&#23450;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35">获取ACL</h4>
<div class="outline-text-4" id="text-orgheadline35">
<div class="org-src-container">

<pre class="src src-bash">getfacl &#25991;&#20214;/&#30446;&#24405;
</pre>
</div>
</div>
</div>
</div>
</div>
